<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"
%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt" %>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>会員登録画面</title>
    <link rel="stylesheet" href="css/style.css">
</head>
<body>
    <header>
        <div class="header-right">
            <img src="./images/Rakuten_pc_32px@2x_wm.png" alt="logo">
        </div>
        <div class="header-left">
            <ul>
                <li><a href="https://www.rakuten.co.jp/">楽天市場</a></li>
                <li><a href="https://ichiba.faq.rakuten.net/">ヘルプ</a></li>
            </ul>
        </div>
    </header>
    <div id="container">
        <div id="language">
            <a href="">日本語|</a>
            <a href="">English|</a>
            <a href="">简体中文</a>
        </div>
        <div id="contents">
            <h2>楽天会員登録</h2>
            <form name="RegistForm" action="touroku" method="post">
                <div id="step1" class="step">
                    <ul>
                        <li style="color: white;">会員情報の入力</li>
                        <li style="color: #BF0000;">入力内容の確認</li>
                        <li style="color: #BF0000;">登録完了</li>
                    </ul>
                </div>
                <h3 class="circle">メールアドレス/ユーザーID/パスワード</h3>
                <table class="address">
                    <tbody>
                        <tr>
                            <th class="head">メールアドレス<span class="right">必須</span>
                                <td>
                                    <em><半角英数字><br>
                                    他の会員が登録済みのメールアドレスは登録できません。<br>
                                    <input id="email" class="text" type="email" name="email" value="${email}"><br>
                                    
                                    <c:if test="${isemailisexist}">
                                    	<img class="emailerror ${emailerror}" src="./images/arrow32.gif" width="32" height="11" alt="">
                                    	<span class="emailerrormes" style="color: #ff0000; font-weight: bold;">${emailnull}</span>
                                    </c:if>
                                    
                                    <br>
                                    確認のためもう一度入力してください（コピー・貼り付けはしないでください。<br>
                                    <input id="emailkakunin" class="text" type="text" name="emailkakunin" value="${emailkakunin}"><br>
                                    
                                    <c:if test="${isemailsame}">
	                                    <img class="emailkakuninerror ${emailkakuninerror}" src="./images/arrow32.gif" width="32" height="11" alt="">
	                                    <span class="emailkakuninerrormes" style="color: #ff0000; font-weight: bold;">${emailequal}</span><br>
	                                    <br>
                                    </c:if>
                                    
                                    </em>
                                </td>
                                <td class="end"><a href="">詳しいヘルプ</a></td>
                            </th>
                        </tr>

                        <tr>
                            <th class="head">ユーザID<span class="right">必須</span>
                                <td>
                                    <em>会員向けサービスにログインするときに使用します。<br>
                                        <input type="radio" id="onaji" name="check" checked value="on">
                                        <label for="onaji">メールアドレスをユーザIDとして使用</label><br><br>
                                        <input type="radio" id="igai" name="check" value="off">
                                        <label for="igai">メールアドレス以外をユーザIDとして使用</label><br>    
                                        <6文字以上・半角英数字> 数字だけにすることはできません<br>
                                        <input id="userId" class="text" type="text" name="userID"><br>
                                        
                                        <c:if test="${isuserempty}">
	                                        <img class="userIderror ${userIderror}" src="./images/arrow32.gif" width="32" height="11" alt="">
	                                        <span class="userIderrormes" style="color: #ff0000; font-weight: bold;">${userempty}</span><br>
	                                        <br>
                                        </c:if>
                                        <c:if test="${eisuji}">
	                                        <img class="userIderror ${usereisujiclass}" src="./images/arrow32.gif" width="32" height="11" alt="">
	                                        <span class="userIderrormes" style="color: #ff0000; font-weight: bold;">${usereisuji}</span><br>
	                                        <br>
                                        </c:if>
                                        
                                    </em>
                                </td>
                                <td class="end"><a href="">詳しいヘルプ</a></td>
                            </th>
                        </tr>

                        <tr>
                            <th class="head">パスワード<span class="right">必須</span>
                                <td>
                                    <em><6文字以上半角英数字><br>
                                        「ユーザID」と同じものは登録できません<br>
                                        第三者によるログインを防ぐために、できるだけ複雑なものを設定してください。<br>
                                        <input id="passWord" class="text" type="password" name="passWord"><br>
                                        <img class="passWorderror" src="./images/arrow32.gif" width="32" height="11" alt="">
                                        <span class="passWorderrormes" style="color: #ff0000; font-weight: bold;"></span><br>
                                        <br><br>
                                    </em>
                                </td>
                                <td class="end"><a href="">詳しいヘルプ</a></td>
                            </th>
                        </tr>
                    </tbody>             
                </table>
                <h3 class="circle">お客様の基本情報</h3>
                <table class="address">
                    <tbody>
                        <tr>
                            <th class="head">氏名<span class="right">必須</span>
                                <td class="end">
                                    <em>入力情報に誤りがあると、パスワード再設定が正しく行えない場合があります。
                                        ご自身の氏名をお間違えないように登録してください。<br>
                                        <ul>
                                            <li><span>（姓）</span><input id="sei" class="text-30" type="text" name="sei"></li>
                                            <li><span>（名）</span><input id="mei" class="text-30" type="text" name="mei"></li>
                                        </ul>
                                        <img class="seierror" src="./images/arrow32.gif" width="32" height="11" alt="">
                                        <span class="seierrormes" style="color: #ff0000; font-weight: bold;"></span><br>
                                        <img class="meierror" src="./images/arrow32.gif" width="32" height="11" alt="">
                                        <span class="meierrormes" style="color: #ff0000; font-weight: bold;"></span><br>
                                    </em>
                                </td>
                            </th>
                        </tr>
                        <tr>
                            <th class="head">氏名（フリガナ）<span class="right">必須</span>
                                <td class="end">
                                    <em><全角カタカナのみ><br>
                                        <ul>
                                            <li><span>（姓）</span><input id="seiKata" class="text-30" type="text" name="seiKata"></li>
                                            <li><span>（名）</span><input id="meiKata" class="text-30" type="text" name="meiKata"></li>
                                        </ul>
                                        <img class="seiKataerror" src="./images/arrow32.gif" width="32" height="11" alt="">
                                        <span class="seiKataerrormes" style="color: #ff0000; font-weight: bold;"></span><br>
                                        <img class="meiKataerror" src="./images/arrow32.gif" width="32" height="11" alt="">
                                        <span class="meiKataerrormes" style="color: #ff0000; font-weight: bold;"></span><br>
                                    </em>
                                </td>
                            </th>
                        </tr>
                    </tbody>             
                </table>
            <p class="sub">
            楽天会員への登録には、規約および<a target="_blank" href="https://privacy.rakuten.co.jp/">個人情報保護方針</a>への同意が必要です。
            </p>
            <p class="submit">
                <input type="submit" id="signup" name="signup" value="同意して次へ" onclick="douiFunc()">  <!--  -->
            </p>
            </form>
            
            <h3 id="rollHead">楽天会員規約/楽天ポイント利用規約/楽天アフィリエイトパートナー規約</h3>
            <div id="roll">
                <div><pre>楽天会員規約

                    楽天グループ株式会社（以下「楽天」といいます。）、その子会社、および関連会社で構
                    成される楽天グループ（以下「楽天グループ」といいます。）は、お客様に最適でユニー
                    クなサービスを提供したいと考えており、グローバルに展開する楽天グループのサービス
                    に容易にアクセスしていただけるように、シングル・ログイン機能を含む共通IDプログラ
                    ム（以下「Rakuten ID」といいます。）を提供しています。
                    お客様は、楽天が定める楽天会員規約（以下「本規約」といいます。）に基づいてアカウ
                    ント（以下「アカウント」といいます。）を作成し、会員サービスをご利用いただくこと
                    ができます。
                    なお、Rakuten IDにてご利用いただけるサービスには、追加のご登録手続きが必要となる
                    ものがございます。そのような場合には、当該サービスのご利用時に別途提示される利用
                    規約等をご確認いただき、追加のご登録手続きをお願いいたします。
                    
                    第１条（楽天会員）
                    １．お客様は、楽天が定める条件に従い、会員サービスを利用することができます。なお
                    、お客様は、アカウントを通じて、楽天グループが提供する各種サービスを利用すること
                    ができますが、当該サービスの中には別途定める事項の登録を要する場合があり、また、
                    あらかじめ当該サービスの利用規約等に同意していただく必要があります。
                    ２．会員サービスには、ポイント等のインセンティブプログラムまたはロイヤルティプロ
                    グラムが含まれます。当該プログラムの内容および利用条件については、楽天が別途定め
                    る規約等に定めるとおりとします。
                    
                    第２条（会員登録）
                    １．本規約に同意のうえ所定の登録手続きを完了すると、お客様と楽天との間で本規約の
                    定めを内容とする契約（以下「本契約」といいます。）が成立し、会員としての資格を得
                    ることができます。会員登録手続きは、会員となるご本人が行ってください。本条に基づ
                    いて、会員資格を得たお客様のことを、以下「会員」といいます。
                    ２．楽天は、過去に会員資格が取り消された方やその他楽天がふさわしくないと判断した
                    方からの会員申込についてはお断りする場合があります。
                    ３．登録手続きの際には、入力上の注意をよくご確認いただき、所定のフォームに必要事
                    項を入力してください。ご登録は真実かつ正確な情報をもって行ってください。楽天は、
                    当該情報に虚偽、誤り、または記入漏れがあったことによりお客様に損害が生じたとして
                    も、楽天の責めに帰すべき事由がある場合を除き、責任を負わないものとします。
                    
                    第３条（IDおよびパスワードの管理）
                    アカウントを利用するためのIDおよびパスワードは、第三者に推測されにくい複雑なパス
                    ワードにする、ログイン状態の端末を第三者に利用させないようにする、第三者の端末を
                    利用してログインした場合には利用後にログアウトする等、会員本人が責任をもって管理
                    してください。楽天グループは、入力または利用されたIDおよびパスワードの組合せが会
                    員の登録したものと一致することを所定の方法により確認した場合、会員による利用が
                    あったものとして会員サービスを提供するものとします。楽天グループは、盗用、不正利
                    用その他の事情により会員のアカウントを当該会員以外の第三者が利用している場合で
                    あっても、楽天の責めに帰すべき事由がある場合を除き、それにより生じた損害について
                    責任を負わないものとします。
                    
                    第４条（アカウントを利用した取引）
                    会員がアカウントを利用して行う、各サービス上での取引（商品またはサービスの購入、
                    購入の申込、およびその他の取引に関する意思表示を含みます。以下同じ。）は、会員と
                    その取引の相手方との間で直接に行われます。楽天グループは、当該取引について会員の
                    相手方となる場合を除き、取引の当事者とはならず、楽天の責めに帰すべき事由がある場
                    合を除き、取引に関する責任を負わないものとします。したがって、かかる場合を除き、
                    取引に際し万一トラブルが生じた場合には、会員とその相手方との間で解決していただく
                    ことになります。
                    
                    第５条（登録情報の変更）
                    会員として登録した情報（以下「登録情報」といいます。）に変更が生じた場合は、速や
                    かに登録情報の変更をお願いいたします。登録情報の変更がなされなかったことにより会
                    員に生じた損害について、楽天は、楽天の責めに帰すべき事由がある場合を除き、責任を
                    負わないものとします。また、変更がなされた場合でも、変更前にすでに手続きがなされ
                    た取引は、変更前の情報に基づいて行われます。登録情報の変更内容を当該取引の相手方
                    に通知する必要がある場合には、会員より当該相手方に直接ご連絡下さい。
                    
                    第６条（楽天によるお知らせ）
                    １．会員サービスに関する楽天から会員への通知等は、最新の登録情報におけるメールア
                    ドレス宛てへのメールの送信、楽天が運営するウェブサイト上への掲示、または、その他
                    楽天が適当と判断する方法によって行います。
                    ２．会員は、楽天がメールの送信による通知を行った場合、前項のメールアドレス宛てに
                    楽天がメールを送信し会員が当該メールを閲覧可能になった時または楽天がメールを送信
                    してから24時間後のいずれか早い時点に楽天からの通知が到達したとみなされることに、
                    あらかじめ同意し、前条の登録情報の変更を行うものとします。
                    
                    第７条（個人情報の取扱い）
                    楽天は、会員による会員サービスの利用に関して取得する個人情報を、楽天の個人情報保
                    護方針（https://privacy.rakuten.co.jp/）に従い、適切に取扱います。
                    
                    第８条（禁止事項）
                    １．会員サービスの利用に際して、会員は、以下の各号に定める行為またはそのおそれの
                    ある行為を行ってはならないものとします。
                    （１）法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に違
                    反する行為
                    （２）公の秩序または善良の風俗を害する行為
                    （３）反社会的勢力に対する利益供与その他の協力行為
                    （４）楽天、楽天グループ、または第三者の権利、利益、名誉等を侵害する行為
                    （５）第三者になりすます行為または意図的に虚偽の情報を送信する行為
                    （６）第三者の個人情報その他のプライバシーに関する情報を不正に収集、開示、または
                    提供する行為
                    （７）不正アクセス行為、第三者のアカウントを利用する行為、複数のアカウントを作成
                    しまたは保有する行為、その他これらに類する行為
                    （８）会員サービスの誤作動を誘引する行為
                    （９）会員サービスが通常意図しないバグを利用する動作、その他通常意図しない効果を
                    及ぼす外部ツールの利用・作成・頒布を行う行為
                    （10）会員サービスまたは楽天のサーバーに過度の負担をかける行為
                    （11）コンピュータウイルス等の有害なプログラムを楽天、楽天グループまたは第三者に
                    送信し、または流布する行為
                    （12）本規約に違反し、または、会員サービスの趣旨目的に反する行為
                    （13）楽天、楽天グループおよびその委託先の従業員等（派遣社員を含む）に対する暴言
                    や威嚇その他その安全や精神衛生等を害する行為
                    （14）その他、手段の如何を問わず、社会通念に照らして著しく不相当な行為であって、
                    会員サービスの運営を妨害するものであると楽天が判断する行為
                    ２．会員は、アカウントおよび本契約の地位等の一切の権利および義務を第三者に譲渡、
                    貸与、売却、担保差入およびその他の処分をしてはならないものとします。
                    
                    第９条（利用停止、会員資格の取り消し等）
                    １．楽天は、会員が次の各号のいずれかに該当すると判断した場合には、事前に通知する
                    ことなく当該会員による会員サービスの利用停止、アカウントの停止、IDおよびパスワー
                    ドの変更、または当該会員の会員資格の取り消し等の措置を講じることができるものとし
                    ます。これにより会員に何らかの不利益または損害が生じたとしても、楽天の責めに帰す
                    べき事由がある場合を除き、楽天は責任を負わないものとします。
                    （１）会員に法令や本規約に違反する行為があった場合
                    （２）会員に会員サービス利用に関して不正行為があった場合
                    （３）一定回数以上のパスワードの入力ミスがあるなど会員のセキュリティを確保するた
                    めに必要な場合
                    （４）その他楽天が合理的に不適切と判断した場合
                    ２．前項のほか、会員が楽天の定める一定の期間内に一定回数のログインを行わなかった
                    場合は、楽天は、事前に通知することなく前項所定の措置を講じることができるものとし
                    ます。措置を講じた場合における楽天の責任の範囲は前項と同様です。
                    
                    第１０条（会員の退会および本契約の終了）
                    １．会員は、楽天所定の退会手続きにより、いつでも本契約を終了させることができます
                    。
                    ２．前項退会手続きにより、または、事由のいかんを問わず本契約が終了した場合、会員
                    は、アカウントおよび会員サービスについて、即時に一切利用できなくなります。当該時
                    点において会員サービスに関連して有していた会員の権利は、楽天グループが各サービス
                    について別途定める場合を除いて全て消滅し、楽天の責めに帰すべき事由がある場合を除
                    き、会員は、楽天に対して何らの請求を行えません。ただし、本契約終了以前において会
                    員が楽天グループに対して債務を負っていた場合、当該債務は消滅せず、会員は、楽天グ
                    ループが各サービスについて別途定める場合を除き、楽天グループに対して本契約終了後
                    ただちに全ての当該債務について弁済しなければならないものとします。
                    ３．会員は、退会手続きを行った場合、楽天グループが提供するRakuten IDに対応した全
                    てのアカウントが同時に削除され、楽天以外の楽天グループ会社が提供する会員サービス
                    についても利用できなくなる場合があることを、あらかじめ承諾するものとし、手続きを
                    終了する前に、注意事項等確認のうえで退会するものとします。
                    
                    第１１条（会員サービスの変更、中断、終了等）
                    １．楽天は、会員サービスの内容の全部もしくは一部を変更もしくは追加し、または会員
                    サービスの提供を終了することができるものとします。
                    ２．前項の場合、楽天は、その影響および会員サービスの運営状況などに照らし、適切な
                    時期および適切な方法により、会員に情報提供を行うものとします。
                    ３．楽天は、以下の各号に定める場合、会員に事前に通知することなく、会員サービスの
                    全部または一部を一時的に中断することができるものとします。
                    （１）システムのメンテナンスまたは修理を定期的にまたは緊急に行う場合
                    （２）アクセス過多等によって、システムに負荷が集中した場合
                    （３）会員、楽天、楽天グループ、または第三者のセキュリティを確保する必要が生じた
                    場合
                    （４）通信回線の停止、天災、火災、停電、その他の不慮の事故または戦争、紛争、動乱
                    、暴動、労働争議等の不可抗力により会員サービスの提供が困難な場合
                    （５）その他楽天が各会員サービスに関する状況に照らして合理的に中断が必要と判断し
                    た場合
                    ４．楽天は、楽天が本条に従ってとった措置に起因して会員に生じた損害について、楽天
                    の責めに帰すべき事由がある場合を除き、責任を負わないものとします。
                    
                    第１２条（保証の否認および免責）
                    １．会員は、楽天が会員サービスを通じて提供するインセンティブプログラム、コンテン
                    ツその他一切の情報について、（１）エラー、バグ、不具合またはセキュリティ上の欠陥
                    が存在しないこと、（２）第三者の権利を侵害しないこと、会員が期待する性質を有する
                    ことおよび会員に適用ある法令に適合的であることについて、楽天がいかなる保証も行わ
                    ないこと、ならびに、（３）会員サービスが会員サービス提供時における現状有姿におい
                    て提供されることを理解し、これを承諾するものとし、自己の責任において会員サービス
                    を利用するものとします。
                    ２．楽天は、会員のアカウントで利用できるサービスに関する内容の真偽、正確性、最新
                    性、有用性、信頼性、適法性、および第三者の権利の不侵害について、本規約においてい
                    かなる保証も行わないものとします。
                    ３．楽天は、会員による会員サービスの利用に関連して、会員に対する責任を負う場合に
                    は、楽天の故意または重大な過失による場合を除き、会員に現実に生じた通常かつ直接の
                    範囲の損害に限り、これを賠償するものとし、特別な事情から生じた損害（損害の発生を
                    予見し、または、予見し得た場合を含みます。）については、責任を負わないものとしま
                    す。
                    
                    第１３条（本規約の改定等）
                    １．楽天は、本規約を任意にいつでも改定することができるものとし、本規約に追加の規
                    定、条件等を定めることができます。この場合、楽天は、その影響および会員サービスの
                    運営状況などに照らし、適切な時期および適切な方法により、会員に情報提供を行うもの
                    とします。
                    ２．楽天は、会員サービスにかかる事業を第三者に譲渡し、または合併もしくは会社分割
                    等により承継させ、本契約上の地位ならびに権利および義務を当該譲渡等の譲受人等に承
                    継させることができるものとします。会員は、かかる譲渡等について、あらかじめ同意す
                    るものとします。
                    
                    第１４条（準拠法、合意管轄）
                    本規約は日本法に基づき解釈されるものとし、本規約に関し訴訟の必要が生じた場合には
                    、東京地方裁判所または東京簡易裁判所を第一審の専属的合意管轄裁判所といたします。
                    
                    
                    　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　以上
                    　　　　　　　　　　　　　　　　　　　　　　　　　　　　 2023年1月17日最終改定
                    
                    
                    楽天ポイント利用規約
                    
                    第１条（目的）
                    １．本規約は、楽天グループ株式会社（以下「楽天」といいます。）が、楽天会員規約（
                    以下「会員規約」といいます。）に基づき会員登録をした会員（以下「会員」といいま
                    す。）に対して、楽天が提供するポイントインセンティブプログラム（「楽天ポイント」
                    またはその後継プログラムを指し、以下「本プログラム」といいます。）に関する基本的
                    事項を定めるものです。
                    ２．本プログラムは、楽天が指定する各種サービス（楽天グループの会社またはそれ以外
                    の第三者が提供するサービスを含み、以下「ポイント付与対象サービス」といいます。）
                    において、会員による物品等の購入、サービスの利用等を促進するため、楽天グループの
                    サービスにおいて利用可能なポイント（以下「ポイント」といいます。）を会員に付与し
                    、会員がこれを楽天所定の各種サービス（以下「ポイント利用対象サービス」といいます
                    。）において利用することができる特典を会員に提供するものです。本規約に規定のない
                    事項については、会員規約が適用されるほか、本プログラムに基づくポイント付与および
                    利用に関して、各種サービスごとまたはキャンペーンごとに定められる諸条件が適用され
                    るものとします。
                    
                    第２条（ポイントの付与）
                    １．楽天は、会員がポイント付与対象サービスにおいて、楽天の指定する方法で物品等の
                    購入またはサービスを利用したとき、その他楽天が相当と認めた場合（以下「対象取引」
                    といいます。）に、ポイントを付与します。
                    ２．ポイント付与対象サービス、対象取引、ポイントの付与率、その他ポイント付与の条
                    件は、楽天が決定し、楽天があらかじめ定める所定のサイト（以下「告知サイト」といい
                    ます。）において会員に告知します。なお、告知サイトにてあらかじめ告知する条件のほ
                    か、ポイントの付与率、付与されるポイントの有効期間等は対象取引ごとに異なる場合が
                    あります。
                    ３．ポイントは、対象取引が行われてから、楽天が定める一定の期間を経た後に付与され
                    ます。この期間内に、楽天が対象取引につき取り消し、返品などがあったことを確認した
                    場合、対象取引にポイントは付与されず、また対象取引に価格の変更があった場合は、変
                    更後の購入額に応じて付与されます。
                    ４．ある取引についてポイントを付与するか否か、付与するポイント数、その他ポイント
                    の付与に関する最終的な判断は、楽天が行うものとし、会員はこれに従うものとします。
                    
                    
                    第３条（ポイントの管理）
                    １．楽天は、楽天所定の方法により、会員が獲得したポイント数、会員が利用したポイン
                    ト数およびポイント数の残高を会員に告知します。
                    ２．会員は、前項のポイント数に疑義のある場合には、ただちに楽天に連絡し、その内容
                    を説明するものとします。
                    ３．第１項のポイント数に関する最終的な決定は楽天が行うものとし、会員はこれに従う
                    ものとします。
                    
                    第４条（ポイントの合算等の禁止）
                    会員は、別途楽天が指定する場合を除き、１つのアカウントにて保有するポイントを他の
                    アカウントに移動させたり、他の会員に譲渡または質入れしたり、会員間でポイントを共
                    有したりすることはできません。
                    
                    第５条（ポイントの取り消し・消滅）
                    １．楽天がポイントを付与した後に、対象取引について返品、キャンセルその他楽天がポ
                    イントの付与を取り消すことが適当と判断する事由があった場合、楽天は、対象取引によ
                    り付与されたポイントを取り消すことができます。
                    ２．楽天は、会員が次の各号のいずれかに該当すると判断した場合、事前に通知すること
                    なく、当該会員が保有するポイントの一部または全部を取り消すことができます。
                    （１）違法または不正行為があった場合
                    （２）本規約、会員規約、その他楽天が定める規約・ルール等に違反があった場合
                    （３）その他楽天が会員に付与されたポイントを取り消すことが適当と判断した場合
                    ３．楽天が定める期間を超えて対象取引を行わなかった場合、ポイントは自動的に消滅し
                    ます。また、楽天はポイントごとに別途有効期間を設ける場合があります。
                    ４．楽天は、楽天の責めに帰すべき事由がある場合を除き、取り消しまたは消滅したポイ
                    ントについて何らの補償も行わず、一切の責任を負いません。
                    
                    第６条（決済におけるポイントの利用）
                    １．会員は、ポイント利用対象サービスにおいて、楽天が定める方法により、決済代金（
                    商品代金、送料、手数料または消費税を含みます。以下同じ。）の精算の全部または一部
                    に、楽天が定める換算率で保有するポイントを利用することができます。ポイント利用対
                    象サービスの提供者が楽天以外の者である場合には、楽天は、利用されたポイントに相当
                    する金額をポイント利用対象サービスの提供者に精算金として支払います。
                    ２．楽天は、第１項のポイント利用の対象となるサービス・商品等を制限したり、ポイン
                    ト利用に条件を付したりすることがあります。
                    ３．会員が第１項による決済を取り消した場合、原則として当該決済において精算のため
                    に利用されたポイントはポイントとして返還され、現金による返還は行われません。ただ
                    し、楽天の事務上の事情などによりポイントでの返還ができない場合には、決済をしたポ
                    イント利用対象サービスから、利用されたポイントに相当する額の現金が返還されること
                    があります。
                    ４．会員が決済代金の精算の全額についてポイントを利用し、その後決済代金が何らかの
                    事情で減額または増額された場合には、ポイント利用対象サービスごとに告知サイトに定
                    める条件または決済時に表示する条件に基づき減額分の代金返還または増額分の支払いの
                    請求を行うものとします。
                    
                    第７条（決済以外でのポイントの利用）
                    １．会員は、前条に定める決済でのポイントの利用のほか、楽天が定める方法により、保
                    有するポイントを、プレゼント、サービス、抽選への応募、その他の特典（以下「特典」
                    と総称します。）と交換することができます。
                    ２．楽天は、会員が保有するポイントにより交換できる特典を随時設定し、これを告知サ
                    イトへの掲示その他楽天所定の方法により告知します。
                    ３．特典の種類、内容、交換に必要なポイント数、その他ポイント利用の条件は楽天が定
                    めるものとし、楽天はこれらをいつでも新規に設定、変更または終了させることができま
                    す。なお、品切れ、提携会社との提携解消、その他の事情により会員から交換の申し出の
                    あった特典を提供できないことがありますが、その場合は、特典を変更していただくか、
                    または当該ポイント数を会員に返還します。
                    ４．楽天は、前項に定める事由により会員に何らかの不利益が発生したとしても、それに
                    ついて補償せず、一切の責任を負いません。
                    ５．会員は、ポイントを利用するときに、特典の送付先、連絡先その他楽天が定める事項
                    を届け出るものとします。会員にプレゼント等の特典を送付する場合、送付先は日本国内
                    における会員本人居住の住所の会員名に対してのみ行われます。別途楽天が指定する場合
                    を除き、海外への送付、会員本人以外への送付、または私書箱への送付はできません。
                    ６．特典によっては、楽天が委託する提携会社から提供されることがあります。この場合
                    の特典利用の条件については、各提携会社の規約または約款等に従うものとし、楽天は特
                    典の品質、有用性について、何ら保証するものではありません。これらの特典に瑕疵があ
                    る場合、当該特典を発送・提供した提携会社と解決するものとします。
                    ７．会員は、楽天または特典提供者に責任がある場合を除き、特典の返品または他の特典
                    への交換をすることはできません。
                    
                    第８条（事故等）
                    第６条の決済対象となった商品または前条の特典につき、その配送中または提供後に遅延
                    、紛失、盗難、損害、破損等の事故が生じた場合は、当該事故が楽天の責任による場合を
                    除き、楽天は一切責任を負わず、ポイントの返還も行いません。
                    
                    第９条（ポイント利用後のポイントの取り消し）
                    １．会員がポイントを決済に利用した後に、本規約にもとづきポイントが取り消された場
                    合は、当該決済の対象となる取引が取り消しまたは保留されることがあります。会員は、
                    ポイントを利用した当該取引が実行済みである場合または実行しようとする場合には、ポ
                    イント取り消しによる不足額を、ただちに現金または楽天の指定する支払方法にて楽天に
                    支払うものとします。
                    ２．会員がポイントを特典の交換に利用した後に、本規約に基づくポイントの取り消しが
                    あった場合は、特典の申込は取り消されます。会員は、すでに特典を受領している場合に
                    は、ただちに楽天に対し特典の返還または特典に相当する金額の支払いを行うものとしま
                    す。
                    
                    第１０条（換金の不可）
                    会員は、いかなる場合でもポイントを換金することはできません。
                    
                    第１１条（第三者による利用）
                    １．ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはで
                    きません。
                    ２．楽天は、ポイント利用時に入力されたIDおよびパスワードが登録されたものと一致す
                    ることを楽天が所定の方法により確認した場合には、会員による利用とみなします。それ
                    が第三者による不正利用であった場合でも、楽天の責めに帰すべき事由がある場合を
                    除き、楽天は利用されたポイントを返還しませんし、会員に生じた損害について一切責任
                    を負いません。
                    
                    第１２条（税金および費用）
                    ポイントの取得、ポイントの利用、特典との交換にともない、税金や付帯費用が発生する
                    場合には、会員がこれらを負担するものとします。
                    
                    第１３条（会員資格の喪失・停止）
                    会員が会員の地位を喪失した場合には、保有するポイントおよび本プログラムの利用に関
                    する一切の権利を失うものとし、また地位の喪失にともなって楽天に対して何らの請求権
                    も取得しないものとします。
                    
                    第１４条（免責）
                    楽天は、本プログラムの運用にその時点での技術水準を前提に最善を尽くしますが、障害
                    が生じないことを保証するものではありません。通信回線やコンピュータなどの障害によ
                    るシステムの中断・遅滞・中止・データの消失、ポイント利用に関する障害、データへの
                    不正アクセス、その他何らかの障害又は支障が生じないことを、楽天は一切保証しないも
                    のとします。
                    
                    第１５条（本プログラムの変更、停止または終了）
                    楽天は、本規約を運営…</pre>
                </div>
            </div>
            <p style="text-align: center;">* 一部ブラウザで規約が末尾まで完全に表示されない場合がございます。<br>
                このような場合は、<b>「規約を別のウィンドウで見る」</b> からご確認ください。<br>
                <a href="https://privacy.rakuten.co.jp/" target="_blank">個人情報保護方針</a>
            </p>
        </div>
    </div>
    <div><hr size="1" style="display:block;">
       <p style="text-align: center;"> © Rakuten Group, Inc.</p>
    </div>
    <script src="js/script.js"></script>
</body>
</html>